# GetReferenceSections Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetReferenceSections Method
View Class See Also
---
Returns element ids of all reference sections in the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetReferenceSections()
```

Visual Basic
---
```text
Public Function GetReferenceSections As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetReferenceSections()
```

# ### Return Value
Element ids of all reference sections in the view.
# See Also
View Class
Autodesk.Revit.DB Namespace